{
  "token_to_id": {
    "<PAD>": 0,
    "<SOS>": 1,
    "<EOS>": 2,
    "<UNK>": 3,
    "M": 4,
    "m": 5,
    "L": 6,
    "l": 7,
    "H": 8,
    "h": 9,
    "V": 10,
    "v": 11,
    "C": 12,
    "c": 13,
    "S": 14,
    "s": 15,
    "Q": 16,
    "q": 17,
    "T": 18,
    "t": 19,
    "A": 20,
    "a": 21,
    "Z": 22,
    "z": 23,
    "<STYLE:serif>": 24,
    "<STYLE:sans-serif>": 25,
    "<STYLE:monospace>": 26,
    "<STYLE:handwriting>": 27,
    "<STYLE:display>": 28,
    "<CHAR:A>": 29,
    "<CHAR:B>": 30,
    "<CHAR:C>": 31,
    "<CHAR:D>": 32,
    "<CHAR:E>": 33,
    "<CHAR:F>": 34,
    "<CHAR:G>": 35,
    "<CHAR:H>": 36,
    "<CHAR:I>": 37,
    "<CHAR:J>": 38,
    "<CHAR:K>": 39,
    "<CHAR:L>": 40,
    "<CHAR:M>": 41,
    "<CHAR:N>": 42,
    "<CHAR:O>": 43,
    "<CHAR:P>": 44,
    "<CHAR:Q>": 45,
    "<CHAR:R>": 46,
    "<CHAR:S>": 47,
    "<CHAR:T>": 48,
    "<CHAR:U>": 49,
    "<CHAR:V>": 50,
    "<CHAR:W>": 51,
    "<CHAR:X>": 52,
    "<CHAR:Y>": 53,
    "<CHAR:Z>": 54,
    "<CHAR:a>": 55,
    "<CHAR:b>": 56,
    "<CHAR:c>": 57,
    "<CHAR:d>": 58,
    "<CHAR:e>": 59,
    "<CHAR:f>": 60,
    "<CHAR:g>": 61,
    "<CHAR:h>": 62,
    "<CHAR:i>": 63,
    "<CHAR:j>": 64,
    "<CHAR:k>": 65,
    "<CHAR:l>": 66,
    "<CHAR:m>": 67,
    "<CHAR:n>": 68,
    "<CHAR:o>": 69,
    "<CHAR:p>": 70,
    "<CHAR:q>": 71,
    "<CHAR:r>": 72,
    "<CHAR:s>": 73,
    "<CHAR:t>": 74,
    "<CHAR:u>": 75,
    "<CHAR:v>": 76,
    "<CHAR:w>": 77,
    "<CHAR:x>": 78,
    "<CHAR:y>": 79,
    "<CHAR:z>": 80,
    "<CHAR:0>": 81,
    "<CHAR:1>": 82,
    "<CHAR:2>": 83,
    "<CHAR:3>": 84,
    "<CHAR:4>": 85,
    "<CHAR:5>": 86,
    "<CHAR:6>": 87,
    "<CHAR:7>": 88,
    "<CHAR:8>": 89,
    "<CHAR:9>": 90,
    "<CHAR:!>": 91,
    "<CHAR:@>": 92,
    "<CHAR:#>": 93,
    "<CHAR:$>": 94,
    "<CHAR:%>": 95,
    "<CHAR:&>": 96,
    "<CHAR:*>": 97,
    "<CHAR:(>": 98,
    "<CHAR:)>": 99,
    "<CHAR:->": 100,
    "<CHAR:+>": 101,
    "<CHAR:=>": 102,
    "<CHAR:[>": 103,
    "<CHAR:]>": 104,
    "<COORD:0>": 105,
    "<COORD:1>": 106,
    "<COORD:2>": 107,
    "<COORD:3>": 108,
    "<COORD:4>": 109,
    "<COORD:5>": 110,
    "<COORD:6>": 111,
    "<COORD:7>": 112,
    "<COORD:8>": 113,
    "<COORD:9>": 114,
    "<COORD:10>": 115,
    "<COORD:11>": 116,
    "<COORD:12>": 117,
    "<COORD:13>": 118,
    "<COORD:14>": 119,
    "<COORD:15>": 120,
    "<COORD:16>": 121,
    "<COORD:17>": 122,
    "<COORD:18>": 123,
    "<COORD:19>": 124,
    "<COORD:20>": 125,
    "<COORD:21>": 126,
    "<COORD:22>": 127,
    "<COORD:23>": 128,
    "<COORD:24>": 129,
    "<COORD:25>": 130,
    "<COORD:26>": 131,
    "<COORD:27>": 132,
    "<COORD:28>": 133,
    "<COORD:29>": 134,
    "<COORD:30>": 135,
    "<COORD:31>": 136,
    "<COORD:32>": 137,
    "<COORD:33>": 138,
    "<COORD:34>": 139,
    "<COORD:35>": 140,
    "<COORD:36>": 141,
    "<COORD:37>": 142,
    "<COORD:38>": 143,
    "<COORD:39>": 144,
    "<COORD:40>": 145,
    "<COORD:41>": 146,
    "<COORD:42>": 147,
    "<COORD:43>": 148,
    "<COORD:44>": 149,
    "<COORD:45>": 150,
    "<COORD:46>": 151,
    "<COORD:47>": 152,
    "<COORD:48>": 153,
    "<COORD:49>": 154,
    "<COORD:50>": 155,
    "<COORD:51>": 156,
    "<COORD:52>": 157,
    "<COORD:53>": 158,
    "<COORD:54>": 159,
    "<COORD:55>": 160,
    "<COORD:56>": 161,
    "<COORD:57>": 162,
    "<COORD:58>": 163,
    "<COORD:59>": 164,
    "<COORD:60>": 165,
    "<COORD:61>": 166,
    "<COORD:62>": 167,
    "<COORD:63>": 168,
    "<COORD:64>": 169,
    "<COORD:65>": 170,
    "<COORD:66>": 171,
    "<COORD:67>": 172,
    "<COORD:68>": 173,
    "<COORD:69>": 174,
    "<COORD:70>": 175,
    "<COORD:71>": 176,
    "<COORD:72>": 177,
    "<COORD:73>": 178,
    "<COORD:74>": 179,
    "<COORD:75>": 180,
    "<COORD:76>": 181,
    "<COORD:77>": 182,
    "<COORD:78>": 183,
    "<COORD:79>": 184,
    "<COORD:80>": 185,
    "<COORD:81>": 186,
    "<COORD:82>": 187,
    "<COORD:83>": 188,
    "<COORD:84>": 189,
    "<COORD:85>": 190,
    "<COORD:86>": 191,
    "<COORD:87>": 192,
    "<COORD:88>": 193,
    "<COORD:89>": 194,
    "<COORD:90>": 195,
    "<COORD:91>": 196,
    "<COORD:92>": 197,
    "<COORD:93>": 198,
    "<COORD:94>": 199,
    "<COORD:95>": 200,
    "<COORD:96>": 201,
    "<COORD:97>": 202,
    "<COORD:98>": 203,
    "<COORD:99>": 204,
    "<COORD:100>": 205,
    "<COORD:101>": 206,
    "<COORD:102>": 207,
    "<COORD:103>": 208,
    "<COORD:104>": 209,
    "<COORD:105>": 210,
    "<COORD:106>": 211,
    "<COORD:107>": 212,
    "<COORD:108>": 213,
    "<COORD:109>": 214,
    "<COORD:110>": 215,
    "<COORD:111>": 216,
    "<COORD:112>": 217,
    "<COORD:113>": 218,
    "<COORD:114>": 219,
    "<COORD:115>": 220,
    "<COORD:116>": 221,
    "<COORD:117>": 222,
    "<COORD:118>": 223,
    "<COORD:119>": 224,
    "<COORD:120>": 225,
    "<COORD:121>": 226,
    "<COORD:122>": 227,
    "<COORD:123>": 228,
    "<COORD:124>": 229,
    "<COORD:125>": 230,
    "<COORD:126>": 231,
    "<COORD:127>": 232,
    "<COORD:128>": 233,
    "<COORD:129>": 234,
    "<COORD:130>": 235,
    "<COORD:131>": 236,
    "<COORD:132>": 237,
    "<COORD:133>": 238,
    "<COORD:134>": 239,
    "<COORD:135>": 240,
    "<COORD:136>": 241,
    "<COORD:137>": 242,
    "<COORD:138>": 243,
    "<COORD:139>": 244,
    "<COORD:140>": 245,
    "<COORD:141>": 246,
    "<COORD:142>": 247,
    "<COORD:143>": 248,
    "<COORD:144>": 249,
    "<COORD:145>": 250,
    "<COORD:146>": 251,
    "<COORD:147>": 252,
    "<COORD:148>": 253,
    "<COORD:149>": 254,
    "<COORD:150>": 255,
    "<COORD:151>": 256,
    "<COORD:152>": 257,
    "<COORD:153>": 258,
    "<COORD:154>": 259,
    "<COORD:155>": 260,
    "<COORD:156>": 261,
    "<COORD:157>": 262,
    "<COORD:158>": 263,
    "<COORD:159>": 264,
    "<COORD:160>": 265,
    "<COORD:161>": 266,
    "<COORD:162>": 267,
    "<COORD:163>": 268,
    "<COORD:164>": 269,
    "<COORD:165>": 270,
    "<COORD:166>": 271,
    "<COORD:167>": 272,
    "<COORD:168>": 273,
    "<COORD:169>": 274,
    "<COORD:170>": 275,
    "<COORD:171>": 276,
    "<COORD:172>": 277,
    "<COORD:173>": 278,
    "<COORD:174>": 279,
    "<COORD:175>": 280,
    "<COORD:176>": 281,
    "<COORD:177>": 282,
    "<COORD:178>": 283,
    "<COORD:179>": 284,
    "<COORD:180>": 285,
    "<COORD:181>": 286,
    "<COORD:182>": 287,
    "<COORD:183>": 288,
    "<COORD:184>": 289,
    "<COORD:185>": 290,
    "<COORD:186>": 291,
    "<COORD:187>": 292,
    "<COORD:188>": 293,
    "<COORD:189>": 294,
    "<COORD:190>": 295,
    "<COORD:191>": 296,
    "<COORD:192>": 297,
    "<COORD:193>": 298,
    "<COORD:194>": 299,
    "<COORD:195>": 300,
    "<COORD:196>": 301,
    "<COORD:197>": 302,
    "<COORD:198>": 303,
    "<COORD:199>": 304,
    "<COORD:200>": 305,
    "<COORD:201>": 306,
    "<COORD:202>": 307,
    "<COORD:203>": 308,
    "<COORD:204>": 309,
    "<COORD:205>": 310,
    "<COORD:206>": 311,
    "<COORD:207>": 312,
    "<COORD:208>": 313,
    "<COORD:209>": 314,
    "<COORD:210>": 315,
    "<COORD:211>": 316,
    "<COORD:212>": 317,
    "<COORD:213>": 318,
    "<COORD:214>": 319,
    "<COORD:215>": 320,
    "<COORD:216>": 321,
    "<COORD:217>": 322,
    "<COORD:218>": 323,
    "<COORD:219>": 324,
    "<COORD:220>": 325,
    "<COORD:221>": 326,
    "<COORD:222>": 327,
    "<COORD:223>": 328,
    "<COORD:224>": 329,
    "<COORD:225>": 330,
    "<COORD:226>": 331,
    "<COORD:227>": 332,
    "<COORD:228>": 333,
    "<COORD:229>": 334,
    "<COORD:230>": 335,
    "<COORD:231>": 336,
    "<COORD:232>": 337,
    "<COORD:233>": 338,
    "<COORD:234>": 339,
    "<COORD:235>": 340,
    "<COORD:236>": 341,
    "<COORD:237>": 342,
    "<COORD:238>": 343,
    "<COORD:239>": 344,
    "<COORD:240>": 345,
    "<COORD:241>": 346,
    "<COORD:242>": 347,
    "<COORD:243>": 348,
    "<COORD:244>": 349,
    "<COORD:245>": 350,
    "<COORD:246>": 351,
    "<COORD:247>": 352,
    "<COORD:248>": 353,
    "<COORD:249>": 354,
    "<COORD:250>": 355,
    "<COORD:251>": 356,
    "<COORD:252>": 357,
    "<COORD:253>": 358,
    "<COORD:254>": 359,
    "<COORD:255>": 360,
    "<COORD:256>": 361,
    "<COORD:257>": 362,
    "<COORD:258>": 363,
    "<COORD:259>": 364,
    "<COORD:260>": 365,
    "<COORD:261>": 366,
    "<COORD:262>": 367,
    "<COORD:263>": 368,
    "<COORD:264>": 369,
    "<COORD:265>": 370,
    "<COORD:266>": 371,
    "<COORD:267>": 372,
    "<COORD:268>": 373,
    "<COORD:269>": 374,
    "<COORD:270>": 375,
    "<COORD:271>": 376,
    "<COORD:272>": 377,
    "<COORD:273>": 378,
    "<COORD:274>": 379,
    "<COORD:275>": 380,
    "<COORD:276>": 381,
    "<COORD:277>": 382,
    "<COORD:278>": 383,
    "<COORD:279>": 384,
    "<COORD:280>": 385,
    "<COORD:281>": 386,
    "<COORD:282>": 387,
    "<COORD:283>": 388,
    "<COORD:284>": 389,
    "<COORD:285>": 390,
    "<COORD:286>": 391,
    "<COORD:287>": 392,
    "<COORD:288>": 393,
    "<COORD:289>": 394,
    "<COORD:290>": 395,
    "<COORD:291>": 396,
    "<COORD:292>": 397,
    "<COORD:293>": 398,
    "<COORD:294>": 399,
    "<COORD:295>": 400,
    "<COORD:296>": 401,
    "<COORD:297>": 402,
    "<COORD:298>": 403,
    "<COORD:299>": 404,
    "<COORD:300>": 405,
    "<COORD:301>": 406,
    "<COORD:302>": 407,
    "<COORD:303>": 408,
    "<COORD:304>": 409,
    "<COORD:305>": 410,
    "<COORD:306>": 411,
    "<COORD:307>": 412,
    "<COORD:308>": 413,
    "<COORD:309>": 414,
    "<COORD:310>": 415,
    "<COORD:311>": 416,
    "<COORD:312>": 417,
    "<COORD:313>": 418,
    "<COORD:314>": 419,
    "<COORD:315>": 420,
    "<COORD:316>": 421,
    "<COORD:317>": 422,
    "<COORD:318>": 423,
    "<COORD:319>": 424,
    "<COORD:320>": 425,
    "<COORD:321>": 426,
    "<COORD:322>": 427,
    "<COORD:323>": 428,
    "<COORD:324>": 429,
    "<COORD:325>": 430,
    "<COORD:326>": 431,
    "<COORD:327>": 432,
    "<COORD:328>": 433,
    "<COORD:329>": 434,
    "<COORD:330>": 435,
    "<COORD:331>": 436,
    "<COORD:332>": 437,
    "<COORD:333>": 438,
    "<COORD:334>": 439,
    "<COORD:335>": 440,
    "<COORD:336>": 441,
    "<COORD:337>": 442,
    "<COORD:338>": 443,
    "<COORD:339>": 444,
    "<COORD:340>": 445,
    "<COORD:341>": 446,
    "<COORD:342>": 447,
    "<COORD:343>": 448,
    "<COORD:344>": 449,
    "<COORD:345>": 450,
    "<COORD:346>": 451,
    "<COORD:347>": 452,
    "<COORD:348>": 453,
    "<COORD:349>": 454,
    "<COORD:350>": 455,
    "<COORD:351>": 456,
    "<COORD:352>": 457,
    "<COORD:353>": 458,
    "<COORD:354>": 459,
    "<COORD:355>": 460,
    "<COORD:356>": 461,
    "<COORD:357>": 462,
    "<COORD:358>": 463,
    "<COORD:359>": 464,
    "<COORD:360>": 465,
    "<COORD:361>": 466,
    "<COORD:362>": 467,
    "<COORD:363>": 468,
    "<COORD:364>": 469,
    "<COORD:365>": 470,
    "<COORD:366>": 471,
    "<COORD:367>": 472,
    "<COORD:368>": 473,
    "<COORD:369>": 474,
    "<COORD:370>": 475,
    "<COORD:371>": 476,
    "<COORD:372>": 477,
    "<COORD:373>": 478,
    "<COORD:374>": 479,
    "<COORD:375>": 480,
    "<COORD:376>": 481,
    "<COORD:377>": 482,
    "<COORD:378>": 483,
    "<COORD:379>": 484,
    "<COORD:380>": 485,
    "<COORD:381>": 486,
    "<COORD:382>": 487,
    "<COORD:383>": 488,
    "<COORD:384>": 489,
    "<COORD:385>": 490,
    "<COORD:386>": 491,
    "<COORD:387>": 492,
    "<COORD:388>": 493,
    "<COORD:389>": 494,
    "<COORD:390>": 495,
    "<COORD:391>": 496,
    "<COORD:392>": 497,
    "<COORD:393>": 498,
    "<COORD:394>": 499,
    "<COORD:395>": 500,
    "<COORD:396>": 501,
    "<COORD:397>": 502,
    "<COORD:398>": 503,
    "<COORD:399>": 504,
    "<COORD:400>": 505,
    "<COORD:401>": 506,
    "<COORD:402>": 507,
    "<COORD:403>": 508,
    "<COORD:404>": 509,
    "<COORD:405>": 510,
    "<COORD:406>": 511,
    "<COORD:407>": 512,
    "<COORD:408>": 513,
    "<COORD:409>": 514,
    "<COORD:410>": 515,
    "<COORD:411>": 516,
    "<COORD:412>": 517,
    "<COORD:413>": 518,
    "<COORD:414>": 519,
    "<COORD:415>": 520,
    "<COORD:416>": 521,
    "<COORD:417>": 522,
    "<COORD:418>": 523,
    "<COORD:419>": 524,
    "<COORD:420>": 525,
    "<COORD:421>": 526,
    "<COORD:422>": 527,
    "<COORD:423>": 528,
    "<COORD:424>": 529,
    "<COORD:425>": 530,
    "<COORD:426>": 531,
    "<COORD:427>": 532,
    "<COORD:428>": 533,
    "<COORD:429>": 534,
    "<COORD:430>": 535,
    "<COORD:431>": 536,
    "<COORD:432>": 537,
    "<COORD:433>": 538,
    "<COORD:434>": 539,
    "<COORD:435>": 540,
    "<COORD:436>": 541,
    "<COORD:437>": 542,
    "<COORD:438>": 543,
    "<COORD:439>": 544,
    "<COORD:440>": 545,
    "<COORD:441>": 546,
    "<COORD:442>": 547,
    "<COORD:443>": 548,
    "<COORD:444>": 549,
    "<COORD:445>": 550,
    "<COORD:446>": 551,
    "<COORD:447>": 552,
    "<COORD:448>": 553,
    "<COORD:449>": 554,
    "<COORD:450>": 555,
    "<COORD:451>": 556,
    "<COORD:452>": 557,
    "<COORD:453>": 558,
    "<COORD:454>": 559,
    "<COORD:455>": 560,
    "<COORD:456>": 561,
    "<COORD:457>": 562,
    "<COORD:458>": 563,
    "<COORD:459>": 564,
    "<COORD:460>": 565,
    "<COORD:461>": 566,
    "<COORD:462>": 567,
    "<COORD:463>": 568,
    "<COORD:464>": 569,
    "<COORD:465>": 570,
    "<COORD:466>": 571,
    "<COORD:467>": 572,
    "<COORD:468>": 573,
    "<COORD:469>": 574,
    "<COORD:470>": 575,
    "<COORD:471>": 576,
    "<COORD:472>": 577,
    "<COORD:473>": 578,
    "<COORD:474>": 579,
    "<COORD:475>": 580,
    "<COORD:476>": 581,
    "<COORD:477>": 582,
    "<COORD:478>": 583,
    "<COORD:479>": 584,
    "<COORD:480>": 585,
    "<COORD:481>": 586,
    "<COORD:482>": 587,
    "<COORD:483>": 588,
    "<COORD:484>": 589,
    "<COORD:485>": 590,
    "<COORD:486>": 591,
    "<COORD:487>": 592,
    "<COORD:488>": 593,
    "<COORD:489>": 594,
    "<COORD:490>": 595,
    "<COORD:491>": 596,
    "<COORD:492>": 597,
    "<COORD:493>": 598,
    "<COORD:494>": 599,
    "<COORD:495>": 600,
    "<COORD:496>": 601,
    "<COORD:497>": 602,
    "<COORD:498>": 603,
    "<COORD:499>": 604,
    "<COORD:500>": 605,
    "<COORD:501>": 606,
    "<COORD:502>": 607,
    "<COORD:503>": 608,
    "<COORD:504>": 609,
    "<COORD:505>": 610,
    "<COORD:506>": 611,
    "<COORD:507>": 612,
    "<COORD:508>": 613,
    "<COORD:509>": 614,
    "<COORD:510>": 615,
    "<COORD:511>": 616,
    "<COORD:512>": 617,
    "<COORD:513>": 618,
    "<COORD:514>": 619,
    "<COORD:515>": 620,
    "<COORD:516>": 621,
    "<COORD:517>": 622,
    "<COORD:518>": 623,
    "<COORD:519>": 624,
    "<COORD:520>": 625,
    "<COORD:521>": 626,
    "<COORD:522>": 627,
    "<COORD:523>": 628,
    "<COORD:524>": 629,
    "<COORD:525>": 630,
    "<COORD:526>": 631,
    "<COORD:527>": 632,
    "<COORD:528>": 633,
    "<COORD:529>": 634,
    "<COORD:530>": 635,
    "<COORD:531>": 636,
    "<COORD:532>": 637,
    "<COORD:533>": 638,
    "<COORD:534>": 639,
    "<COORD:535>": 640,
    "<COORD:536>": 641,
    "<COORD:537>": 642,
    "<COORD:538>": 643,
    "<COORD:539>": 644,
    "<COORD:540>": 645,
    "<COORD:541>": 646,
    "<COORD:542>": 647,
    "<COORD:543>": 648,
    "<COORD:544>": 649,
    "<COORD:545>": 650,
    "<COORD:546>": 651,
    "<COORD:547>": 652,
    "<COORD:548>": 653,
    "<COORD:549>": 654,
    "<COORD:550>": 655,
    "<COORD:551>": 656,
    "<COORD:552>": 657,
    "<COORD:553>": 658,
    "<COORD:554>": 659,
    "<COORD:555>": 660,
    "<COORD:556>": 661,
    "<COORD:557>": 662,
    "<COORD:558>": 663,
    "<COORD:559>": 664,
    "<COORD:560>": 665,
    "<COORD:561>": 666,
    "<COORD:562>": 667,
    "<COORD:563>": 668,
    "<COORD:564>": 669,
    "<COORD:565>": 670,
    "<COORD:566>": 671,
    "<COORD:567>": 672,
    "<COORD:568>": 673,
    "<COORD:569>": 674,
    "<COORD:570>": 675,
    "<COORD:571>": 676,
    "<COORD:572>": 677,
    "<COORD:573>": 678,
    "<COORD:574>": 679,
    "<COORD:575>": 680,
    "<COORD:576>": 681,
    "<COORD:577>": 682,
    "<COORD:578>": 683,
    "<COORD:579>": 684,
    "<COORD:580>": 685,
    "<COORD:581>": 686,
    "<COORD:582>": 687,
    "<COORD:583>": 688,
    "<COORD:584>": 689,
    "<COORD:585>": 690,
    "<COORD:586>": 691,
    "<COORD:587>": 692,
    "<COORD:588>": 693,
    "<COORD:589>": 694,
    "<COORD:590>": 695,
    "<COORD:591>": 696,
    "<COORD:592>": 697,
    "<COORD:593>": 698,
    "<COORD:594>": 699,
    "<COORD:595>": 700,
    "<COORD:596>": 701,
    "<COORD:597>": 702,
    "<COORD:598>": 703,
    "<COORD:599>": 704,
    "<COORD:600>": 705,
    "<COORD:601>": 706,
    "<COORD:602>": 707,
    "<COORD:603>": 708,
    "<COORD:604>": 709,
    "<COORD:605>": 710,
    "<COORD:606>": 711,
    "<COORD:607>": 712,
    "<COORD:608>": 713,
    "<COORD:609>": 714,
    "<COORD:610>": 715,
    "<COORD:611>": 716,
    "<COORD:612>": 717,
    "<COORD:613>": 718,
    "<COORD:614>": 719,
    "<COORD:615>": 720,
    "<COORD:616>": 721,
    "<COORD:617>": 722,
    "<COORD:618>": 723,
    "<COORD:619>": 724,
    "<COORD:620>": 725,
    "<COORD:621>": 726,
    "<COORD:622>": 727,
    "<COORD:623>": 728,
    "<COORD:624>": 729,
    "<COORD:625>": 730,
    "<COORD:626>": 731,
    "<COORD:627>": 732,
    "<COORD:628>": 733,
    "<COORD:629>": 734,
    "<COORD:630>": 735,
    "<COORD:631>": 736,
    "<COORD:632>": 737,
    "<COORD:633>": 738,
    "<COORD:634>": 739,
    "<COORD:635>": 740,
    "<COORD:636>": 741,
    "<COORD:637>": 742,
    "<COORD:638>": 743,
    "<COORD:639>": 744,
    "<COORD:640>": 745,
    "<COORD:641>": 746,
    "<COORD:642>": 747,
    "<COORD:643>": 748,
    "<COORD:644>": 749,
    "<COORD:645>": 750,
    "<COORD:646>": 751,
    "<COORD:647>": 752,
    "<COORD:648>": 753,
    "<COORD:649>": 754,
    "<COORD:650>": 755,
    "<COORD:651>": 756,
    "<COORD:652>": 757,
    "<COORD:653>": 758,
    "<COORD:654>": 759,
    "<COORD:655>": 760,
    "<COORD:656>": 761,
    "<COORD:657>": 762,
    "<COORD:658>": 763,
    "<COORD:659>": 764,
    "<COORD:660>": 765,
    "<COORD:661>": 766,
    "<COORD:662>": 767,
    "<COORD:663>": 768,
    "<COORD:664>": 769,
    "<COORD:665>": 770,
    "<COORD:666>": 771,
    "<COORD:667>": 772,
    "<COORD:668>": 773,
    "<COORD:669>": 774,
    "<COORD:670>": 775,
    "<COORD:671>": 776,
    "<COORD:672>": 777,
    "<COORD:673>": 778,
    "<COORD:674>": 779,
    "<COORD:675>": 780,
    "<COORD:676>": 781,
    "<COORD:677>": 782,
    "<COORD:678>": 783,
    "<COORD:679>": 784,
    "<COORD:680>": 785,
    "<COORD:681>": 786,
    "<COORD:682>": 787,
    "<COORD:683>": 788,
    "<COORD:684>": 789,
    "<COORD:685>": 790,
    "<COORD:686>": 791,
    "<COORD:687>": 792,
    "<COORD:688>": 793,
    "<COORD:689>": 794,
    "<COORD:690>": 795,
    "<COORD:691>": 796,
    "<COORD:692>": 797,
    "<COORD:693>": 798,
    "<COORD:694>": 799,
    "<COORD:695>": 800,
    "<COORD:696>": 801,
    "<COORD:697>": 802,
    "<COORD:698>": 803,
    "<COORD:699>": 804,
    "<COORD:700>": 805,
    "<COORD:701>": 806,
    "<COORD:702>": 807,
    "<COORD:703>": 808,
    "<COORD:704>": 809,
    "<COORD:705>": 810,
    "<COORD:706>": 811,
    "<COORD:707>": 812,
    "<COORD:708>": 813,
    "<COORD:709>": 814,
    "<COORD:710>": 815,
    "<COORD:711>": 816,
    "<COORD:712>": 817,
    "<COORD:713>": 818,
    "<COORD:714>": 819,
    "<COORD:715>": 820,
    "<COORD:716>": 821,
    "<COORD:717>": 822,
    "<COORD:718>": 823,
    "<COORD:719>": 824,
    "<COORD:720>": 825,
    "<COORD:721>": 826,
    "<COORD:722>": 827,
    "<COORD:723>": 828,
    "<COORD:724>": 829,
    "<COORD:725>": 830,
    "<COORD:726>": 831,
    "<COORD:727>": 832,
    "<COORD:728>": 833,
    "<COORD:729>": 834,
    "<COORD:730>": 835,
    "<COORD:731>": 836,
    "<COORD:732>": 837,
    "<COORD:733>": 838,
    "<COORD:734>": 839,
    "<COORD:735>": 840,
    "<COORD:736>": 841,
    "<COORD:737>": 842,
    "<COORD:738>": 843,
    "<COORD:739>": 844,
    "<COORD:740>": 845,
    "<COORD:741>": 846,
    "<COORD:742>": 847,
    "<COORD:743>": 848,
    "<COORD:744>": 849,
    "<COORD:745>": 850,
    "<COORD:746>": 851,
    "<COORD:747>": 852,
    "<COORD:748>": 853,
    "<COORD:749>": 854,
    "<COORD:750>": 855,
    "<COORD:751>": 856,
    "<COORD:752>": 857,
    "<COORD:753>": 858,
    "<COORD:754>": 859,
    "<COORD:755>": 860,
    "<COORD:756>": 861,
    "<COORD:757>": 862,
    "<COORD:758>": 863,
    "<COORD:759>": 864,
    "<COORD:760>": 865,
    "<COORD:761>": 866,
    "<COORD:762>": 867,
    "<COORD:763>": 868,
    "<COORD:764>": 869,
    "<COORD:765>": 870,
    "<COORD:766>": 871,
    "<COORD:767>": 872,
    "<COORD:768>": 873,
    "<COORD:769>": 874,
    "<COORD:770>": 875,
    "<COORD:771>": 876,
    "<COORD:772>": 877,
    "<COORD:773>": 878,
    "<COORD:774>": 879,
    "<COORD:775>": 880,
    "<COORD:776>": 881,
    "<COORD:777>": 882,
    "<COORD:778>": 883,
    "<COORD:779>": 884,
    "<COORD:780>": 885,
    "<COORD:781>": 886,
    "<COORD:782>": 887,
    "<COORD:783>": 888,
    "<COORD:784>": 889,
    "<COORD:785>": 890,
    "<COORD:786>": 891,
    "<COORD:787>": 892,
    "<COORD:788>": 893,
    "<COORD:789>": 894,
    "<COORD:790>": 895,
    "<COORD:791>": 896,
    "<COORD:792>": 897,
    "<COORD:793>": 898,
    "<COORD:794>": 899,
    "<COORD:795>": 900,
    "<COORD:796>": 901,
    "<COORD:797>": 902,
    "<COORD:798>": 903,
    "<COORD:799>": 904,
    "<COORD:800>": 905,
    "<COORD:801>": 906,
    "<COORD:802>": 907,
    "<COORD:803>": 908,
    "<COORD:804>": 909,
    "<COORD:805>": 910,
    "<COORD:806>": 911,
    "<COORD:807>": 912,
    "<COORD:808>": 913,
    "<COORD:809>": 914,
    "<COORD:810>": 915,
    "<COORD:811>": 916,
    "<COORD:812>": 917,
    "<COORD:813>": 918,
    "<COORD:814>": 919,
    "<COORD:815>": 920,
    "<COORD:816>": 921,
    "<COORD:817>": 922,
    "<COORD:818>": 923,
    "<COORD:819>": 924,
    "<COORD:820>": 925,
    "<COORD:821>": 926,
    "<COORD:822>": 927,
    "<COORD:823>": 928,
    "<COORD:824>": 929,
    "<COORD:825>": 930,
    "<COORD:826>": 931,
    "<COORD:827>": 932,
    "<COORD:828>": 933,
    "<COORD:829>": 934,
    "<COORD:830>": 935,
    "<COORD:831>": 936,
    "<COORD:832>": 937,
    "<COORD:833>": 938,
    "<COORD:834>": 939,
    "<COORD:835>": 940,
    "<COORD:836>": 941,
    "<COORD:837>": 942,
    "<COORD:838>": 943,
    "<COORD:839>": 944,
    "<COORD:840>": 945,
    "<COORD:841>": 946,
    "<COORD:842>": 947,
    "<COORD:843>": 948,
    "<COORD:844>": 949,
    "<COORD:845>": 950,
    "<COORD:846>": 951,
    "<COORD:847>": 952,
    "<COORD:848>": 953,
    "<COORD:849>": 954,
    "<COORD:850>": 955,
    "<COORD:851>": 956,
    "<COORD:852>": 957,
    "<COORD:853>": 958,
    "<COORD:854>": 959,
    "<COORD:855>": 960,
    "<COORD:856>": 961,
    "<COORD:857>": 962,
    "<COORD:858>": 963,
    "<COORD:859>": 964,
    "<COORD:860>": 965,
    "<COORD:861>": 966,
    "<COORD:862>": 967,
    "<COORD:863>": 968,
    "<COORD:864>": 969,
    "<COORD:865>": 970,
    "<COORD:866>": 971,
    "<COORD:867>": 972,
    "<COORD:868>": 973,
    "<COORD:869>": 974,
    "<COORD:870>": 975,
    "<COORD:871>": 976,
    "<COORD:872>": 977,
    "<COORD:873>": 978,
    "<COORD:874>": 979,
    "<COORD:875>": 980,
    "<COORD:876>": 981,
    "<COORD:877>": 982,
    "<COORD:878>": 983,
    "<COORD:879>": 984,
    "<COORD:880>": 985,
    "<COORD:881>": 986,
    "<COORD:882>": 987,
    "<COORD:883>": 988,
    "<COORD:884>": 989,
    "<COORD:885>": 990,
    "<COORD:886>": 991,
    "<COORD:887>": 992,
    "<COORD:888>": 993,
    "<COORD:889>": 994,
    "<COORD:890>": 995,
    "<COORD:891>": 996,
    "<COORD:892>": 997,
    "<COORD:893>": 998,
    "<COORD:894>": 999,
    "<COORD:895>": 1000,
    "<COORD:896>": 1001,
    "<COORD:897>": 1002,
    "<COORD:898>": 1003,
    "<COORD:899>": 1004,
    "<COORD:900>": 1005,
    "<COORD:901>": 1006,
    "<COORD:902>": 1007,
    "<COORD:903>": 1008,
    "<COORD:904>": 1009,
    "<COORD:905>": 1010,
    "<COORD:906>": 1011,
    "<COORD:907>": 1012,
    "<COORD:908>": 1013,
    "<COORD:909>": 1014,
    "<COORD:910>": 1015,
    "<COORD:911>": 1016,
    "<COORD:912>": 1017,
    "<COORD:913>": 1018,
    "<COORD:914>": 1019,
    "<COORD:915>": 1020,
    "<COORD:916>": 1021,
    "<COORD:917>": 1022,
    "<COORD:918>": 1023,
    "<COORD:919>": 1024,
    "<COORD:920>": 1025,
    "<COORD:921>": 1026,
    "<COORD:922>": 1027,
    "<COORD:923>": 1028,
    "<COORD:924>": 1029,
    "<COORD:925>": 1030,
    "<COORD:926>": 1031,
    "<COORD:927>": 1032,
    "<COORD:928>": 1033,
    "<COORD:929>": 1034,
    "<COORD:930>": 1035,
    "<COORD:931>": 1036,
    "<COORD:932>": 1037,
    "<COORD:933>": 1038,
    "<COORD:934>": 1039,
    "<COORD:935>": 1040,
    "<COORD:936>": 1041,
    "<COORD:937>": 1042,
    "<COORD:938>": 1043,
    "<COORD:939>": 1044,
    "<COORD:940>": 1045,
    "<COORD:941>": 1046,
    "<COORD:942>": 1047,
    "<COORD:943>": 1048,
    "<COORD:944>": 1049,
    "<COORD:945>": 1050,
    "<COORD:946>": 1051,
    "<COORD:947>": 1052,
    "<COORD:948>": 1053,
    "<COORD:949>": 1054,
    "<COORD:950>": 1055,
    "<COORD:951>": 1056,
    "<COORD:952>": 1057,
    "<COORD:953>": 1058,
    "<COORD:954>": 1059,
    "<COORD:955>": 1060,
    "<COORD:956>": 1061,
    "<COORD:957>": 1062,
    "<COORD:958>": 1063,
    "<COORD:959>": 1064,
    "<COORD:960>": 1065,
    "<COORD:961>": 1066,
    "<COORD:962>": 1067,
    "<COORD:963>": 1068,
    "<COORD:964>": 1069,
    "<COORD:965>": 1070,
    "<COORD:966>": 1071,
    "<COORD:967>": 1072,
    "<COORD:968>": 1073,
    "<COORD:969>": 1074,
    "<COORD:970>": 1075,
    "<COORD:971>": 1076,
    "<COORD:972>": 1077,
    "<COORD:973>": 1078,
    "<COORD:974>": 1079,
    "<COORD:975>": 1080,
    "<COORD:976>": 1081,
    "<COORD:977>": 1082,
    "<COORD:978>": 1083,
    "<COORD:979>": 1084,
    "<COORD:980>": 1085,
    "<COORD:981>": 1086,
    "<COORD:982>": 1087,
    "<COORD:983>": 1088,
    "<COORD:984>": 1089,
    "<COORD:985>": 1090,
    "<COORD:986>": 1091,
    "<COORD:987>": 1092,
    "<COORD:988>": 1093,
    "<COORD:989>": 1094,
    "<COORD:990>": 1095,
    "<COORD:991>": 1096,
    "<COORD:992>": 1097,
    "<COORD:993>": 1098,
    "<COORD:994>": 1099,
    "<COORD:995>": 1100,
    "<COORD:996>": 1101,
    "<COORD:997>": 1102,
    "<COORD:998>": 1103,
    "<COORD:999>": 1104
  },
  "vocab_size": 1105,
  "special_tokens": [
    "<PAD>",
    "<SOS>",
    "<EOS>",
    "<UNK>"
  ],
  "num_commands": 20,
  "num_styles": 5,
  "num_chars": 76,
  "coord_range": 1000
}